////包含20行30个整数的文件，读取内容到20x30的int型数组，用int数组初始化20x31的字符阵列
////0代表空格、1代表句号、2代表单引号、3代表:、4代表~、5代表*、6等号=、8代表%、9代表#
//#include<stdio.h>
//#include<stdlib.h>//exit()
//#include<ctype.h>//itoa()
//#define LINE 20
//#define COLUMN 30
//#define BUFSIZE 1024
//
//void createFile(FILE * fp);
//
//int main()
//{
//	FILE * fp;
//	char show[LINE][3*COLUMN];
//	int i = 0;
//	int j  =0;
//
//	//打开文件
//	if((fp = fopen("data","r+")) == NULL)
//	{
//		fprintf(stderr,"Can't open file \"data\".\n");
//		exit(EXIT_FAILURE);
//	}
//	//创建缓冲区
//	if(setvbuf(fp,NULL,_IOFBF,BUFSIZE) != 0)
//	{
//		fprintf(stderr,"Fail to create input buff.\n");
//	}
//	//初始化文件createFile(fp);
//	//读取字符串
//	while(fgets(show[i++],3*COLUMN,fp) != NULL)
//	{
//		;
//	}
//	//输出数组元素
//	//for(i = 0;i < LINE;i++)
//	//	fputs(show[i],stdout);
//	putchar('\n');
//	for(i = 0;i < LINE;i++)
//	{
//		for(j = 0;j < 2*COLUMN;j++)
//		{
//			switch(show[i][j])
//			{
//			case '0':printf(" ");break;
//			case '1':printf(".");break;
//			case '2':printf("'");break;
//			case '3':printf(":");break;
//			case '4':printf("~");break;
//			case '5':printf("*");break;
//			case '6':printf("=");break;
//			case '8':printf("%%");break;
//			case '9':printf("#");break;
//			default:printf(" ");break;
//			}
//		}
//		putchar('\n');
//	}
//	if(ferror(fp) != 0)
//	{
//		fprintf(stderr,"Error in reading file\"data\".\n");
//	}
//	if(fclose(fp) != 0)
//	{
//		fprintf(stderr,"Error in closing file \"data\".\n");
//	}
//	puts("Done");
//	return 0;
//}
////生成文件
//void createFile(FILE * fp)
//{
//	int init[LINE][COLUMN] = {
//		{0,0,9,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,2,0,0,0,0,0,0,0,0,0,0,0},
//		{0,0,0,0,9,0,0,0,0,0,0,0,5,8,9,9,8,5,5,2,0,0,0,0,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,1,9,8,5,4,5,2,0,0,0,0,0,0,0,0,0},
//		{0,0,0,0,9,0,0,0,0,0,0,0,5,8,9,9,8,5,0,4,5,2,0,0,0,0,0,0,0,0},
//		{0,0,9,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,4,5,2,0,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,1,8,5,0,0,0,4,5,2,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,4,5,2,0,0,0,0,0},
//		{5,5,5,5,5,5,5,5,5,5,5,5,5,8,9,9,8,5,5,5,5,5,5,5,5,5,5,5,5,5},
//		{8,8,8,8,8,8,8,8,8,8,8,8,5,8,9,9,8,5,8,8,8,8,8,8,8,8,8,8,8,8},
//		{9,9,9,9,0,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,9,3,9,9,9,9,9,9,9},
//		{8,8,8,8,8,8,8,8,8,8,8,8,5,8,9,9,8,5,8,8,8,8,8,8,8,8,8,8,8,8},
//		{5,5,5,5,5,5,5,5,5,5,5,5,5,8,9,9,8,5,5,5,5,5,5,5,5,5,5,5,5,5},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,0,0,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,6,6,0,0,0,0,0,0},
//		{0,0,0,0,2,2,0,0,0,0,0,0,5,8,9,9,8,5,0,0,5,6,0,0,6,5,0,0,0,0},
//		{0,0,0,0,3,3,0,0,0,0,0,0,5,8,9,9,8,5,0,5,6,1,1,1,1,6,5,0,0,0},
//		{0,0,0,0,4,4,0,0,0,0,0,0,5,8,9,9,8,5,0,0,5,6,0,0,6,5,0,0,0,0},
//		{0,0,0,0,5,5,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,6,6,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,0,0,0,0,0,0,0,0},
//		{0,0,0,0,0,0,0,0,0,0,0,0,5,8,9,9,8,5,0,0,0,0,0,0,0,0,0,0,0,0},
//	};
//	int i,j;//数组循环
//
//	//将int数组写入文件
//	for(i = 0;i < LINE;i++)
//	{
//		for(j = 0;j < COLUMN;j++)
//		{
//			fprintf(fp,"%d ",init[i][j]);
//		}
//		fprintf(fp,"\n");
//	}
//}